---
kind: method
id: M:Autodesk.Revit.DB.TessellatedShapeBuilderResult.Dispose
source: html/c6fe4067-905b-9f4a-7403-ec7ee52a5ca7.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilderResult.Dispose Method

Releases all resources used by the TessellatedShapeBuilderResult

## Syntax (C#)
```csharp
public void Dispose()
```